output/posts/handy-python-packages/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Some Handy Python Tricks  | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/handy-python-packages/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="Some Handy Python Tricks ">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/handy-python-packages/">
<meta property="og:description" content="Save local Environment in Ipython and continue from where you left


How to save your local environment and continue from where you left on
Ipython:



https://www.reddit.com/r/IPython/comments/6reiqp">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-04-14T15:15:50+02:00">
<meta property="article:tag" content="programming">
<meta property="article:tag" content="Python">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Some Handy Python Tricks </a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2020-04-14T15:15:50+02:00" itemprop="datePublished" title="2020-04-14 15:15">2020-04-14 15:15</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/programming/" rel="tag">programming</a></li>
            <li><a class="tag p-category" href="../../categories/python/" rel="tag">Python</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org883da05" class="outline-2">
<h2 id="org883da05">Save local Environment in Ipython and continue from where you left</h2>
<div class="outline-text-2" id="text-org883da05">
<p>
How to save your local environment and continue from where you left on
Ipython:
</p>

<p>
<a href="https://www.reddit.com/r/IPython/comments/6reiqp/how_can_i_save_and_load_the_state_of_the_kernel/">https://www.reddit.com/r/IPython/comments/6reiqp/how_can_i_save_and_load_the_state_of_the_kernel/</a>
</p>
</div>
</div>

<div id="outline-container-orgd86751e" class="outline-2">
<h2 id="orgd86751e">Clear the local environment</h2>
<div class="outline-text-2" id="text-orgd86751e">
<p>
When using <code>Ipython</code> you can simply use the handy <code>%reset</code> magic
command.
</p>

<p>
When using a <code>Python</code> interpreter you can use the following snippet
</p>

<div class="highlight"><pre><span></span>   <span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">list</span><span class="p">(</span><span class="nb">globals</span><span class="p">()</span><span class="o">.</span><span class="n">keys</span><span class="p">()):</span>
       <span class="k">if</span><span class="p">(</span><span class="n">i</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span> <span class="o">!=</span> <span class="s1">'_'</span><span class="p">):</span>
	   <span class="k">exec</span><span class="p">(</span><span class="s1">'del {}'</span><span class="o">.</span><span class="n">format</span><span class="p">(</span><span class="n">i</span><span class="p">))</span>
</pre></div>
</div>
</div>

<div id="outline-container-org15cbd45" class="outline-2">
<h2 id="org15cbd45">Check at the source code of a function you are using in Python</h2>
<div class="outline-text-2" id="text-org15cbd45">
<div class="highlight"><pre><span></span> import dill
 import cProfile
 print(dill.source.getsource(cProfile.Profile.print_stats))
</pre></div>
</div>
</div>

<div id="outline-container-org76d9a5d" class="outline-2">
<h2 id="org76d9a5d">Debugging Python within Emacs</h2>
<div class="outline-text-2" id="text-org76d9a5d">
</div>
<div id="outline-container-org40d4997" class="outline-3">
<h3 id="org40d4997">Python</h3>
<div class="outline-text-3" id="text-org40d4997">
<p>
<a href="https://www.masteringemacs.org/article/compiling-running-scripts-emacs">https://www.masteringemacs.org/article/compiling-running-scripts-emacs</a>
</p>

<p>
<code>M-x pdb</code> 
</p>

<p>
Then you enter the script you aim to debug.
</p>

<p>
<code>python3 -m pdb app_local.py</code>.
</p>

<p>
Finally you can enter <code>h</code> in the debugger to display all of the
available options for it.
</p>

<p>
<a href="https://jakevdp.github.io/PythonDataScienceHandbook/01.06-errors-and-debugging.HTML">https://jakevdp.github.io/PythonDataScienceHandbook/01.06-errors-and-debugging.HTML</a>
</p>
</div>
</div>

<div id="outline-container-org06ac045" class="outline-3">
<h3 id="org06ac045">Ipython</h3>
<div class="outline-text-3" id="text-org06ac045">
<p>
Interesting is the option to debug in <code>ipython notebooks</code>. This
can be done again with a magic command <code>%debug</code>. I use <code>ein</code> and
there it triggers a new buffer where you can enter the usual <code>pdb</code>
commands. For more look at <a href="https://paris-swc.github.io/python-testing-debugging-profiling/07-debugging-post-mortem.html">this link</a>.
</p>

<p>
Example:
</p>

<pre class="example">
In [532]:
%debug
for i in range(10):
    print(i)
    i +=1
    print(i)
</pre>
</div>
</div>
</div>

<div id="outline-container-org94c5458" class="outline-2">
<h2 id="org94c5458">Reload changed module</h2>
<div class="outline-text-2" id="text-org94c5458">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">importlib</span>
<span class="n">importlib</span><span class="o">.</span><span class="n">reload</span><span class="p">(</span><span class="n">prova</span><span class="p">)</span>
</pre></div>

<p>
<a href="https://chrisyeh96.github.io/2017/08/08/definitive-guide-python-imports.html">link on how to deal with import packages</a>
</p>

<p>
Another possibility if you have two modules called in the same way
that are saved on different directories is to use the following
schema:
</p>

<div class="highlight"><pre><span></span><span class="k">def</span> <span class="nf">remove_module</span><span class="p">(</span><span class="n">module</span><span class="p">):</span>
    <span class="k">if</span> <span class="n">module</span> <span class="ow">in</span> <span class="n">sys</span><span class="o">.</span><span class="n">modules</span><span class="p">:</span>  
	<span class="k">del</span> <span class="n">sys</span><span class="o">.</span><span class="n">modules</span><span class="p">[</span><span class="n">module</span><span class="p">]</span>
</pre></div>

<p>
This function can then be used in combination to another one where you
remove the <code>path</code> to your module first. Like this when providing the
new sys.path to import the module your Python interpreter will not do
any confusion among the two.
</p>

<p>
For instance in the snippet below I use a regular expression to remove
all the modules that match from the sys.path. Then in a second step I
delete all of the modules maintained by the interpreter.
</p>

<div class="highlight"><pre><span></span><span class="n">r</span> <span class="o">=</span> <span class="n">re</span><span class="o">.</span><span class="n">compile</span><span class="p">(</span><span class="s2">"/Users/marcohassan/Desktop/IBM_projects/SchutzRettung/module-analytics/app/src/algorithms/.*"</span><span class="p">)</span>

<span class="n">newlist</span> <span class="o">=</span> <span class="nb">list</span><span class="p">(</span><span class="nb">filter</span><span class="p">(</span><span class="n">r</span><span class="o">.</span><span class="n">match</span><span class="p">,</span> <span class="n">sys</span><span class="o">.</span><span class="n">path</span><span class="p">))</span> <span class="c1"># Read Note</span>

<span class="k">for</span> <span class="n">element</span> <span class="ow">in</span> <span class="n">newlist</span><span class="p">:</span>
    <span class="n">sys</span><span class="o">.</span><span class="n">path</span><span class="o">.</span><span class="n">remove</span><span class="p">(</span><span class="n">element</span><span class="p">)</span>

<span class="n">mod</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'ranking'</span><span class="p">,</span> <span class="s1">'preprocessingTree'</span><span class="p">,</span> <span class="s1">'extract_tokens'</span><span class="p">,</span>
       <span class="s1">'best_next_question'</span><span class="p">,</span> <span class="s1">'merge'</span><span class="p">,</span> <span class="s1">'rank_word'</span><span class="p">]</span>

<span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="n">mod</span><span class="p">:</span>
    <span class="n">remove_module</span><span class="p">(</span><span class="n">i</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-orga0e5d1e" class="outline-2">
<h2 id="orga0e5d1e">Profiling in Python</h2>
<div class="outline-text-2" id="text-orga0e5d1e">
<p>
<a href="https://docs.python.org/3.2/library/profile.html">https://docs.python.org/3.2/library/profile.html</a>
</p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">cProfile</span>
<span class="kn">import</span> <span class="nn">pstats</span>

<span class="n">pr</span> <span class="o">=</span> <span class="n">cProfile</span><span class="o">.</span><span class="n">Profile</span><span class="p">()</span>
<span class="n">pr</span><span class="o">.</span><span class="n">enable</span><span class="p">()</span>

<span class="n">res</span> <span class="o">=</span> <span class="n">minimize</span><span class="p">(</span><span class="n">min_matched</span><span class="p">,</span> <span class="n">x0</span> <span class="o">=</span> <span class="n">x0</span><span class="p">,</span> <span class="n">method</span><span class="o">=</span><span class="s1">'nelder-mead'</span><span class="p">,</span> 
	 <span class="n">options</span><span class="o">=</span><span class="p">{</span><span class="s1">'xatol'</span><span class="p">:</span> <span class="mf">1e-8</span><span class="p">,</span> <span class="s1">'disp'</span><span class="p">:</span> <span class="bp">True</span><span class="p">,</span> <span class="s1">'maxiter'</span> <span class="p">:</span> <span class="mi">2</span><span class="p">,</span>
		  <span class="s1">'maxfev'</span> <span class="p">:</span> <span class="mi">2</span><span class="p">})</span>

<span class="n">pr</span><span class="o">.</span><span class="n">disable</span><span class="p">()</span>

<span class="n">pstats</span><span class="o">.</span><span class="n">Stats</span><span class="p">(</span><span class="n">pr</span><span class="p">)</span><span class="o">.</span><span class="n">strip_dirs</span><span class="p">()</span><span class="o">.</span><span class="n">sort_stats</span><span class="p">(</span><span class="s1">'cumtime'</span><span class="p">)</span><span class="o">.</span><span class="n">print_stats</span><span class="p">(</span><span class="mf">0.01</span><span class="p">)</span>
</pre></div>

<p>
Notice that the last argument - the <code>0.01</code> above - means that you will
display only the top 1% percentile of the output. This is handy as
often there are a zillion of minor functions your python interpreter
calls that are probably not interesting to your analysis.
</p>
</div>
</div>

<div id="outline-container-orgbcdfc18" class="outline-2">
<h2 id="orgbcdfc18">Loops with tqdm</h2>
<div class="outline-text-2" id="text-orgbcdfc18">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">tqdm</span> 
</pre></div>
</div>
</div>

<div id="outline-container-org2093c01" class="outline-2">
<h2 id="org2093c01">Staticmethod for Class calls</h2>
<div class="outline-text-2" id="text-org2093c01">
<p>
with staticmethod you do not have to refer to an class
object. The argument self is omitted as a variable and you
simply call it by using `unite<sub>score.scale</sub><sub>scores</sub>()'. It is
nothing more than a function defined inside a class. It is
callable without instantiating the class first. It’s definition
is immutable via inheritance.
</p>

<div class="highlight"><pre><span></span><span class="nd">@staticmethod</span>
<span class="k">def</span> <span class="nf">scale_scores</span><span class="p">(</span><span class="n">score_dictionary</span><span class="p">,</span>
		 <span class="n">scale</span> <span class="o">=</span> <span class="s2">"max"</span><span class="p">):</span>
</pre></div>
</div>
</div>

<div id="outline-container-orgcb09ca1" class="outline-2">
<h2 id="orgcb09ca1">User interface for data analysis</h2>
<div class="outline-text-2" id="text-orgcb09ca1">
<p>
see saved item on 
</p>
</div>
</div>
<div id="outline-container-orgc355449" class="outline-2">
<h2 id="orgc355449">Use pseudo code to keep track of what you do</h2>
<div class="outline-text-2" id="text-orgc355449">
<p>
When you write docstrings use pseudo code to document the logical
structure
</p>

<pre class="example">
for ec in len(dict_levenshtein):
    for path in ec:
	for question in path:
	   do x
	for answer in path:
	   do y
</pre>
</div>
</div>
<div id="outline-container-org38ad47c" class="outline-2">
<h2 id="org38ad47c">Difference of variable inside or outside the <span class="underline"><span class="underline">init</span></span> method.</h2>
<div class="outline-text-2" id="text-org38ad47c">
<p>
View the second answer for the bester explaination.
</p>

<p>
<a href="https://stackoverflow.com/questions/1537202/difference-between-variables-inside-and-outside-of-init">https://stackoverflow.com/questions/1537202/difference-between-variables-inside-and-outside-of-init</a>
</p>
</div>
</div>
<div id="outline-container-org6d5f664" class="outline-2">
<h2 id="org6d5f664">Access global variable within a function / a flask route</h2>
<div class="outline-text-2" id="text-org6d5f664">
<div class="highlight"><pre><span></span><span class="n">first_call</span> <span class="o">=</span> <span class="bp">True</span>

<span class="n">app</span> <span class="o">=</span> <span class="n">Flask</span><span class="p">(</span><span class="vm">__name__</span><span class="p">)</span>

<span class="nd">@app.route</span><span class="p">(</span><span class="s1">'/api/test'</span><span class="p">,</span> <span class="n">methods</span><span class="o">=</span><span class="p">[</span><span class="s1">'GET'</span><span class="p">])</span>
<span class="k">def</span> <span class="nf">hello</span><span class="p">():</span>
    <span class="k">global</span> <span class="n">first_call</span> <span class="c1"># means</span>

    <span class="k">print</span><span class="p">(</span><span class="n">first_call</span><span class="p">)</span>

    <span class="n">first_call</span> <span class="o">=</span> <span class="bp">False</span>

    <span class="k">return</span> <span class="nb">str</span><span class="p">(</span><span class="n">first_call</span><span class="p">)</span>
</pre></div>
</div>
</div>
<div id="outline-container-org8405f0e" class="outline-2">
<h2 id="org8405f0e">Web server</h2>
<div class="outline-text-2" id="text-org8405f0e">
<p>
When working with flask always double check that you are not using
the built-in <code>Werkzeug</code> server that is not suited for
production. You can check at the server by making a call to an
endpoint and analyzing the headers.
</p>

<div class="highlight"><pre><span></span>   <span class="n">res</span> <span class="o">=</span> <span class="n">requests</span><span class="o">.</span><span class="n">post</span><span class="p">(</span><span class="s1">'url'</span><span class="p">,</span> <span class="n">data</span> <span class="o">=</span> <span class="n">json</span><span class="o">.</span><span class="n">dumps</span><span class="p">(</span><span class="n">payload</span><span class="p">))</span>
   <span class="n">res</span><span class="o">.</span><span class="n">headers</span>
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside></article><footer id="footer"><p>Contents © 2020         <a href="mailto:marco.hassan30@gmail.com">Marco Hassan</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </section><script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
